0.57.2119-1/Catalogs/ККСНГ_Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУчастникаЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>47</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючДоступаAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПодпискиСК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНастройкиОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ККСНГ_СпособыАвторизацииКурьер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногопользовательскийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемыйМодуль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикПослеФормированияЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособАвторизации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ККСНГ_СпособыАвторизацииКурьер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь1С</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючДоступаAPI</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Enums/ККСНГ_СпособыАвторизацииКурьер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ККСНГ_СпособыАвторизацииКурьер</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ApiKey</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТокенСбербанка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_Организации/Forms/ФормаНастройкиРасписанияАвтообмена/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем НастройкиРегламентногоЗадания, СписокДоступныхПользователей, ЧтениеНастроек;
	
	ЭтотОбъект.ОрганизацияЭДО = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.Параметры, "ОрганизацияЭДО");
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ОрганизацияЭДО) Тогда
		ВызватьИсключение "Не указана организация";
	КонецЕсли;
	
	ЧтениеНастроек = ККСНГ_РегламентныеЗадания.ПрочитатьНастройкиРегламентногоЗаданияАвтообмена(ЭтотОбъект.ОрганизацияЭДО);
	Если Не ЧтениеНастроек.Успех Тогда
		ВызватьИсключение "Не удалось прочитать настройки регламентного задания";
	КонецЕсли;
	
	НастройкиРегламентногоЗадания = ЧтениеНастроек.Результат;
	ЭтотОбъект.Использование = НастройкиРегламентногоЗадания.Использование;
	ЭтотОбъект.РасписаниеРегламентногоЗадания = НастройкиРегламентногоЗадания.Расписание;
	ЭтотОбъект.ПользовательЭДО = НастройкиРегламентногоЗадания.ПользовательЭДО;
	
	// Заполнение списка доступных пользователей
	СписокДоступныхПользователей = ПолучитьСписокДоступныхПользователей();
	ЭтотОбъект.Элементы.ПользовательЭДО.СписокВыбора.ЗагрузитьЗначения(СписокДоступныхПользователей);
	Если СписокДоступныхПользователей.Найти(ЭтотОбъект.ПользовательЭДО) = Неопределено Тогда
		// Очистим, если пользователь из настроек не в списке доступных
		ЭтотОбъект.ПользовательЭДО = Неопределено;
	КонецЕсли;
	
	// Представление расписания
	Если ТипЗнч(ЭтотОбъект.РасписаниеРегламентногоЗадания) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		ЭтотОбъект.РасписаниеРегламентногоЗадания = "Установить расписание...";
	КонецЕсли;
	
	// Выбор пользователя доступен только для многопользовательского режима
	Элементы.ПользовательЭДО.Доступность = ЭтотОбъект.ОрганизацияЭДО.МногопользовательскийРежим;
	// Выбор пользователя обязателен только для многопользовательского режима
	Элементы.ПользовательЭДО.АвтоОтметкаНезаполненного = ЭтотОбъект.ОрганизацияЭДО.МногопользовательскийРежим;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ОрганизацияЭДО.МногопользовательскийРежим Тогда
		ПроверяемыеРеквизиты.Очистить();
		ПроверяемыеРеквизиты.Добавить("ПользовательЭДО");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РасписаниеРегламентногоЗаданияНажатие(Элемент, СтандартнаяОбработка)
	
	ОткрытьНастройкиРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Перем ЗаписьНастроек;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьНастроек = СохранитьНастройкиАвтообменаНаСервере();
	
	Если ЗаписьНастроек.Успех Тогда
		Оповестить("ККСНГ_ИзменениеНастроекАвтообмена", ЭтотОбъект.ОрганизацияЭДО);
		Закрыть();
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ЖурналСообщенийВывестиСообщенияПользователю(ЗаписьНастроек.Журнал, "-1");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СохранитьНастройкиАвтообменаНаСервере()
	
	Перем Ответ, ЗаписьНастроек;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	ЗаписьНастроек = ККСНГ_РегламентныеЗадания.ЗаписатьНастройкиРегламентногоЗаданияАвтообмена(ЭтотОбъект.ОрганизацияЭДО, ЭтотОбъект.ПользовательЭДО, ЭтотОбъект.РасписаниеРегламентногоЗадания, ЭтотОбъект.Использование);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗаписьНастроек.Журнал);
	
	Ответ.Успех = ЗаписьНастроек.Успех;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Открывает типовое окно настройки расписания регламентного задания
// Параметры:
//           *ПереданноеРасписание - РасписаниеРегламентногоЗадания - если передано пустое значение то будет создано новое расписание,
//                                                                    если значение заполнено то будет открыто это расписание.
&НаКлиенте
Процедура ОткрытьНастройкиРасписанияРегламентногоЗадания(ПереданноеРасписание)
	
	Перем Диалог, ОписаниеОповещенияПослеВыбораРасписания;
	Перем Расписание;
	
	Если ТипЗнч(ПереданноеРасписание) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		Расписание =  Новый РасписаниеРегламентногоЗадания;
	Иначе
		Расписание = ПереданноеРасписание;
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	
	ОписаниеОповещенияПослеВыбораРасписания = Новый ОписаниеОповещения("ПослеУстановкиРасписанияРегламентногоЗадания", ЭтотОбъект);
	
	Диалог.Показать(ОписаниеОповещенияПослеВыбораРасписания);
	
КонецПроцедуры

// Вызывается после оповещения о закрытии окна настройки расписания регламентного задания
// и заполняет реквизит формы выбранным расписанием.
//
//     Параметры:
//               *Результат - произвольно - результат закрытия окна расписания
//               *ДополнительныеПараметры - структура - дополнительные параметры
&НаКлиенте
Процедура ПослеУстановкиРасписанияРегламентногоЗадания(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("РасписаниеРегламентногоЗадания") Тогда
		ЭтотОбъект.РасписаниеРегламентногоЗадания = Результат;
	КонецЕсли;
	
КонецПроцедуры

// Делает доступным выбор только тех пользователей, для которых настроен способ авторизации с помощью ApiKey
//
&НаСервере
Функция ПолучитьСписокДоступныхПользователей()
	
	Перем СписокДоступныхПользователей, НастройкаДоступа;
	
	СписокДоступныхПользователей = Новый Массив();
	
	Если ЭтотОбъект.ОрганизацияЭДО.МногопользовательскийРежим Тогда
		Для Каждого НастройкаДоступа Из ОрганизацияЭДО.НастройкиДоступа Цикл
			
			Если НастройкаДоступа.СпособАвторизации = Перечисления.ККСНГ_СпособыАвторизацииКурьер.ApiKey Тогда
				СписокДоступныхПользователей.Добавить(НастройкаДоступа.Пользователь1С);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокДоступныхПользователей;
	
КонецФункции

#КонецОбласти
